stm32-rs/stm32f4xx-hal/src/dma/traits.rs
impl Instance for DMA2 {
    #[inline]
    fn ptr() -> *const DMARegisterBlock {
        DMA2::ptr()
    }
}

/// Trait for peripheral's clock enabling.
pub trait RccEnable: Sealed {
    /// Enable the peripheral's clock in the RCC.
    fn rcc_enable(&self);
}

impl RccEnable for pac::DMA1 {
    fn rcc_enable(&self) {
        unsafe {
            //NOTE(unsafe) this reference will only be used for atomic writes with no side effects
            let rcc = &(*RCC::ptr());
            // Enable and reset the timer peripheral
            bb::set(&rcc.ahb1enr, 21);
            bb::set(&rcc.ahb1rstr, 21);
            bb::clear(&rcc.ahb1rstr, 21);
        }
    }
}

impl RccEnable for pac::DMA2 {
    fn rcc_enable(&self) {
        unsafe {
            //NOTE(unsafe) this reference will only be used for atomic writes with no side effects
            let rcc = &(*RCC::ptr());
            // Enable and reset the timer peripheral
            bb::set(&rcc.ahb1enr, 22);
            bb::set(&rcc.ahb1rstr, 22);
            bb::clear(&rcc.ahb1rstr, 22);
        }
    }
}

macro_rules! tim_channels {
    ($(($name:ident, $register:ident)),+ $(,)*) => {
        $(
            /// Wrapper type that indicates which register of the contained timer to use for DMA.
            pub struct $name<T> (T);

            impl<T> Deref for $name<T> {
                type Target = T;

                #[inline]
                fn deref(&self) -> &T {
                    &self.0
                }
            }
        )+
    };
}

/// A channel that can be configured on a DMA stream.
pub trait Channel: Bits<u8> {
    /// Returns a new instance of the type.
    fn new() -> Self;
}

tim_channels!(
    (CCR1, ccr1),
    (CCR2, ccr2),
    (CCR3, ccr3),
    (CCR4, ccr4),
    (DMAR, dmar),
    (ARR, arr),
);

macro_rules! dma_map {
    ($(($Stream:ty, $channel:ty, $Peripheral:ty, $dir:ty)),+ $(,)*) => {
        $(
            impl Sealed for ($Stream, $channel, $Peripheral, $dir) {}
        )+
    };
}

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream0<DMA1>, Channel2, CCR1<pac::TIM4>, MemoryToPeripheral), //TIM4_CH1
    (Stream0<DMA1>, Channel2, CCR1<pac::TIM4>, PeripheralToMemory), //TIM4_CH1
    (Stream2<DMA1>, Channel5, CCR4<pac::TIM3>, MemoryToPeripheral), //TIM3_CH4
    (Stream2<DMA1>, Channel5, CCR4<pac::TIM3>, PeripheralToMemory), //TIM3_CH4
    (Stream2<DMA1>, Channel5, DMAR<pac::TIM3>, MemoryToPeripheral), //TIM3_UP
    (Stream2<DMA1>, Channel5, DMAR<pac::TIM3>, PeripheralToMemory), //TIM3_UP
    (Stream3<DMA1>, Channel2, CCR2<pac::TIM4>, MemoryToPeripheral), //TIM4_CH2
    (Stream3<DMA1>, Channel2, CCR2<pac::TIM4>, PeripheralToMemory), //TIM4_CH2
    (Stream4<DMA1>, Channel5, CCR1<pac::TIM3>, MemoryToPeripheral), //TIM3_CH1
    (Stream4<DMA1>, Channel5, CCR1<pac::TIM3>, PeripheralToMemory), //TIM3_CH1
    (Stream4<DMA1>, Channel5, DMAR<pac::TIM3>, MemoryToPeripheral), //TIM3_TRIG
    (Stream4<DMA1>, Channel5, DMAR<pac::TIM3>, PeripheralToMemory), //TIM3_TRIG
    (Stream5<DMA1>, Channel3, CCR1<pac::TIM2>, MemoryToPeripheral), //TIM2_CH1
    (Stream5<DMA1>, Channel3, CCR1<pac::TIM2>, PeripheralToMemory), //TIM2_CH1
    (Stream5<DMA1>, Channel5, CCR2<pac::TIM3>, MemoryToPeripheral), //TIM3_CH2
    (Stream5<DMA1>, Channel5, CCR2<pac::TIM3>, PeripheralToMemory), //TIM3_CH2
    (Stream6<DMA1>, Channel2, DMAR<pac::TIM4>, MemoryToPeripheral), //TIM4_UP
    (Stream6<DMA1>, Channel2, DMAR<pac::TIM4>, PeripheralToMemory), //TIM4_UP
    (Stream6<DMA1>, Channel3, CCR2<pac::TIM2>, MemoryToPeripheral), //TIM2_CH2
    (Stream6<DMA1>, Channel3, CCR2<pac::TIM2>, PeripheralToMemory), //TIM2_CH2
    (Stream6<DMA1>, Channel3, CCR4<pac::TIM2>, MemoryToPeripheral), //TIM2_CH4
    (Stream6<DMA1>, Channel3, CCR4<pac::TIM2>, PeripheralToMemory), //TIM2_CH4
    (Stream7<DMA1>, Channel2, CCR3<pac::TIM4>, MemoryToPeripheral), //TIM4_CH3
    (Stream7<DMA1>, Channel2, CCR3<pac::TIM4>, PeripheralToMemory), //TIM4_CH3
    (Stream7<DMA1>, Channel5, CCR3<pac::TIM3>, MemoryToPeripheral), //TIM3_CH3
    (Stream7<DMA1>, Channel5, CCR3<pac::TIM3>, PeripheralToMemory), //TIM3_CH3
    (Stream0<DMA1>, Channel0, pac::SPI3, PeripheralToMemory),       //SPI3_RX
    (Stream2<DMA1>, Channel0, pac::SPI3, PeripheralToMemory),       //SPI3_RX
    (Stream4<DMA1>, Channel3, pac::I2C3, MemoryToPeripheral),       //I2C3_TX
    (Stream5<DMA1>, Channel0, pac::SPI3, MemoryToPeripheral),       //SPI3_TX
    (Stream7<DMA1>, Channel0, pac::SPI3, MemoryToPeripheral),       //SPI3_TX
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (CCR1<pac::TIM4>, ccr1, u16),
    (CCR4<pac::TIM3>, ccr4, u16),
    (CCR1<pac::TIM2>, ccr1, u16),
    (CCR1<pac::TIM3>, ccr1, u16),
    (CCR2<pac::TIM2>, ccr2, u16),
    (CCR2<pac::TIM3>, ccr2, u16),
    (CCR2<pac::TIM4>, ccr2, u16),
    (CCR3<pac::TIM3>, ccr3, u16),
    (CCR3<pac::TIM4>, ccr3, u16),
    (CCR4<pac::TIM2>, ccr4, u16),
    (DMAR<pac::TIM3>, dmar, u16),
    (DMAR<pac::TIM4>, dmar, u16),
    (pac::SPI3, dr, u8),
    (pac::I2C3, dr, u8),
);

#[cfg(not(any(feature = "stm32f410", feature = "stm32f446")))]
dma_map!(
    (Stream3<DMA2>, Channel4, pac::SDIO, MemoryToPeripheral), //SDIO
    (Stream3<DMA2>, Channel4, pac::SDIO, PeripheralToMemory), //SDIO
    (Stream6<DMA2>, Channel4, pac::SDIO, MemoryToPeripheral), //SDIO
    (Stream6<DMA2>, Channel4, pac::SDIO, PeripheralToMemory), //SDIO
);

#[cfg(not(any(feature = "stm32f410", feature = "stm32f446")))]
address!((pac::SDIO, fifo, u32),);

#[cfg(feature = "stm32f446")]
dma_map!(
    (Stream3<DMA2>, Channel4, pac::SDMMC, MemoryToPeripheral), //SDMMC
    (Stream3<DMA2>, Channel4, pac::SDMMC, PeripheralToMemory), //SDMMC
    (Stream6<DMA2>, Channel4, pac::SDMMC, MemoryToPeripheral), //SDMMC
    (Stream6<DMA2>, Channel4, pac::SDMMC, PeripheralToMemory), //SDMMC
);

#[cfg(feature = "stm32f446")]
address!((pac::SDMMC, sdmmc_fifor, u32),);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream0<DMA1>, Channel6, CCR3<pac::TIM5>, MemoryToPeripheral), //TIM5_CH3
    (Stream0<DMA1>, Channel6, CCR3<pac::TIM5>, PeripheralToMemory), //TIM5_CH3
    (Stream0<DMA1>, Channel6, DMAR<pac::TIM5>, MemoryToPeripheral), //TIM5_UP
    (Stream0<DMA1>, Channel6, DMAR<pac::TIM5>, PeripheralToMemory), //TIM5_UP
    (Stream1<DMA1>, Channel6, CCR4<pac::TIM5>, MemoryToPeripheral), //TIM5_CH4
    (Stream1<DMA1>, Channel6, CCR4<pac::TIM5>, PeripheralToMemory), //TIM5_CH4
    (Stream1<DMA1>, Channel6, DMAR<pac::TIM5>, MemoryToPeripheral), //TIM5_TRIG
    (Stream1<DMA1>, Channel6, DMAR<pac::TIM5>, PeripheralToMemory), //TIM5_TRIG
    (Stream2<DMA1>, Channel6, CCR1<pac::TIM5>, MemoryToPeripheral), //TIM5_CH1
    (Stream2<DMA1>, Channel6, CCR1<pac::TIM5>, PeripheralToMemory), //TIM5_CH1
    (Stream3<DMA1>, Channel6, CCR4<pac::TIM5>, MemoryToPeripheral), //TIM5_CH4
    (Stream3<DMA1>, Channel6, CCR4<pac::TIM5>, PeripheralToMemory), //TIM5_CH4
    (Stream3<DMA1>, Channel6, DMAR<pac::TIM5>, MemoryToPeripheral), //TIM5_TRIG
    (Stream3<DMA1>, Channel6, DMAR<pac::TIM5>, PeripheralToMemory), //TIM5_TRIG
    (Stream4<DMA1>, Channel6, CCR2<pac::TIM5>, MemoryToPeripheral), //TIM5_CH2
    (Stream4<DMA1>, Channel6, CCR2<pac::TIM5>, PeripheralToMemory), //TIM5_CH2
    (Stream6<DMA1>, Channel6, DMAR<pac::TIM5>, MemoryToPeripheral), //TIM5_UP
    (Stream6<DMA1>, Channel6, DMAR<pac::TIM5>, PeripheralToMemory), //TIM5_UP
    (Stream0<DMA2>, Channel6, DMAR<pac::TIM1>, MemoryToPeripheral), //TIM1_TRIG
    (Stream0<DMA2>, Channel6, DMAR<pac::TIM1>, PeripheralToMemory), //TIM1_TRIG
    (Stream1<DMA2>, Channel6, CCR1<pac::TIM1>, MemoryToPeripheral), //TIM1_CH1
    (Stream1<DMA2>, Channel6, CCR1<pac::TIM1>, PeripheralToMemory), //TIM1_CH1
    (Stream2<DMA2>, Channel6, CCR2<pac::TIM1>, MemoryToPeripheral), //TIM1_CH2
    (Stream2<DMA2>, Channel6, CCR2<pac::TIM1>, PeripheralToMemory), //TIM1_CH2
    (Stream3<DMA2>, Channel6, CCR1<pac::TIM1>, MemoryToPeripheral), //TIM1_CH1
    (Stream3<DMA2>, Channel6, CCR1<pac::TIM1>, PeripheralToMemory), //TIM1_CH1
    (Stream4<DMA2>, Channel6, CCR4<pac::TIM1>, MemoryToPeripheral), //TIM1_CH4
    (Stream4<DMA2>, Channel6, CCR4<pac::TIM1>, PeripheralToMemory), //TIM1_CH4
    (Stream4<DMA2>, Channel6, DMAR<pac::TIM1>, MemoryToPeripheral), //TIM1_TRIG/COM
    (Stream4<DMA2>, Channel6, DMAR<pac::TIM1>, PeripheralToMemory), //TIM1_TRIG/COM
    (Stream5<DMA2>, Channel6, DMAR<pac::TIM1>, MemoryToPeripheral), //TIM1_UP
    (Stream5<DMA2>, Channel6, DMAR<pac::TIM1>, PeripheralToMemory), //TIM1_UP
    (Stream6<DMA2>, Channel0, CCR1<pac::TIM1>, MemoryToPeripheral), //TIM1_CH1
    (Stream6<DMA2>, Channel0, CCR1<pac::TIM1>, PeripheralToMemory), //TIM1_CH1
    (Stream6<DMA2>, Channel0, CCR2<pac::TIM1>, MemoryToPeripheral), //TIM1_CH2
    (Stream6<DMA2>, Channel0, CCR2<pac::TIM1>, PeripheralToMemory), //TIM1_CH2
    (Stream6<DMA2>, Channel0, CCR3<pac::TIM1>, MemoryToPeripheral), //TIM1_CH3
    (Stream6<DMA2>, Channel0, CCR3<pac::TIM1>, PeripheralToMemory), //TIM1_CH3
    (Stream6<DMA2>, Channel6, CCR3<pac::TIM1>, MemoryToPeripheral), //TIM1_CH3
    (Stream6<DMA2>, Channel6, CCR3<pac::TIM1>, PeripheralToMemory), //TIM1_CH3
    (Stream0<DMA1>, Channel1, pac::I2C1, PeripheralToMemory),       //I2C1_RX
    (Stream2<DMA1>, Channel7, pac::I2C2, PeripheralToMemory),       //I2C2_RX
    (Stream3<DMA1>, Channel0, pac::SPI2, PeripheralToMemory),       //SPI2_RX
    (Stream3<DMA1>, Channel7, pac::I2C2, PeripheralToMemory),       //I2C2_RX
    (Stream4<DMA1>, Channel0, pac::SPI2, MemoryToPeripheral),       //SPI2_TX
    (Stream5<DMA1>, Channel1, pac::I2C1, PeripheralToMemory),       //I2C1_RX
    (Stream5<DMA1>, Channel4, pac::USART2, PeripheralToMemory),     //USART2_RX
    (Stream6<DMA1>, Channel4, pac::USART2, MemoryToPeripheral),     //USART2_TX
    (Stream7<DMA1>, Channel7, pac::I2C2, MemoryToPeripheral),       //I2C2_TX
    (Stream0<DMA2>, Channel0, pac::ADC1, PeripheralToMemory),       //ADC1
    (Stream0<DMA2>, Channel3, pac::SPI1, PeripheralToMemory),       //SPI1_RX
    (Stream1<DMA2>, Channel5, pac::USART6, PeripheralToMemory),     //USART6_RX
    (Stream2<DMA2>, Channel3, pac::SPI1, PeripheralToMemory),       //SPI1_RX
    (Stream2<DMA2>, Channel4, pac::USART1, PeripheralToMemory),     //USART1_RX
    (Stream2<DMA2>, Channel5, pac::USART6, PeripheralToMemory),     //USART6_RX
    (Stream4<DMA2>, Channel0, pac::ADC1, PeripheralToMemory),       //ADC1
    (Stream5<DMA2>, Channel4, pac::USART1, PeripheralToMemory),     //USART1_RX
    (Stream6<DMA2>, Channel5, pac::USART6, MemoryToPeripheral),     //USART6_TX
    (Stream7<DMA2>, Channel4, pac::USART1, MemoryToPeripheral),     //USART1_TX
    (Stream7<DMA2>, Channel5, pac::USART6, MemoryToPeripheral),     //USART6_TX
    (
        Stream0<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream1<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream2<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream3<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream4<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream5<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream6<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream7<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream0<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream1<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream2<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream3<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream4<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream5<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream6<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream7<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream0<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream1<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream2<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream3<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream4<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream5<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream6<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream7<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (CCR1<pac::TIM1>, ccr1, u16),
    (CCR2<pac::TIM1>, ccr2, u16),
    (CCR3<pac::TIM1>, ccr3, u16),
    (CCR4<pac::TIM1>, ccr4, u16),
    (DMAR<pac::TIM1>, dmar, u16),
    (CCR1<pac::TIM5>, ccr1, u16),
    (CCR2<pac::TIM5>, ccr2, u16),
    (CCR3<pac::TIM5>, ccr3, u16),
    (CCR4<pac::TIM5>, ccr4, u16),
    (DMAR<pac::TIM5>, dmar, u16),
    (pac::ADC1, dr, u16),
    (pac::I2C1, dr, u8),
    (pac::I2C2, dr, u8),
    (pac::SPI1, dr, u8),
    (pac::SPI2, dr, u8),
    (pac::USART1, dr, u8),
    (pac::USART2, dr, u8),
    (pac::USART6, dr, u8),
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f446",
))]
dma_map!(
    (Stream1<DMA1>, Channel1, pac::I2C3, PeripheralToMemory), //I2C3_RX
    (Stream2<DMA1>, Channel3, pac::I2C3, PeripheralToMemory), //I2C3_RX:DMA_CHANNEL_3
);

#[cfg(any(feature = "stm32f401", feature = "stm32f411",))]
dma_map!(
    (Stream1<DMA1>, Channel3, CCR3<pac::TIM2>, MemoryToPeripheral), //TIM2_CH3
    (Stream1<DMA1>, Channel3, CCR3<pac::TIM2>, PeripheralToMemory), //TIM2_CH3
    (Stream1<DMA1>, Channel3, DMAR<pac::TIM2>, MemoryToPeripheral), //TIM2_UP
    (Stream1<DMA1>, Channel3, DMAR<pac::TIM2>, PeripheralToMemory), //TIM2_UP
    (Stream7<DMA1>, Channel3, CCR4<pac::TIM2>, MemoryToPeripheral), //TIM2_CH4
    (Stream7<DMA1>, Channel3, CCR4<pac::TIM2>, PeripheralToMemory), //TIM2_CH4
    (Stream7<DMA1>, Channel3, DMAR<pac::TIM2>, MemoryToPeripheral), //TIM2_UP
    (Stream7<DMA1>, Channel3, DMAR<pac::TIM2>, PeripheralToMemory), //TIM2_UP
);

#[cfg(any(feature = "stm32f401", feature = "stm32f411",))]
address!((CCR3<pac::TIM2>, ccr3, u16), (DMAR<pac::TIM2>, dmar, u16),);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_map!((Stream5<DMA1>, Channel6, pac::I2C3, MemoryToPeripheral),); //I2C3_TX:DMA_CHANNEL_6);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream6<DMA1>, Channel1, pac::I2C1, MemoryToPeripheral), //I2C1_TX
    (Stream7<DMA1>, Channel1, pac::I2C1, MemoryToPeripheral), //I2C1_TX
    (Stream3<DMA2>, Channel3, pac::SPI1, MemoryToPeripheral), //SPI1_TX
    (Stream5<DMA2>, Channel3, pac::SPI1, MemoryToPeripheral), //SPI1_TX
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream0<DMA2>, Channel4, pac::SPI4, PeripheralToMemory), //SPI4_RX
    (Stream1<DMA2>, Channel4, pac::SPI4, MemoryToPeripheral), //SPI4_TX
    (Stream3<DMA2>, Channel5, pac::SPI4, PeripheralToMemory), //SPI4_RX:DMA_CHANNEL_5
    (Stream4<DMA2>, Channel5, pac::SPI4, MemoryToPeripheral), //SPI4_TX:DMA_CHANNEL_5
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((pac::SPI4, dr, u8),);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream0<DMA1>, Channel4, pac::UART5, PeripheralToMemory), //UART5_RX
    (Stream2<DMA1>, Channel4, pac::UART4, PeripheralToMemory), //UART4_RX
    (Stream4<DMA1>, Channel4, pac::UART4, MemoryToPeripheral), //UART4_TX
                                                               //(pac::DMA1, Stream6, Channel7, pac::DAC2, MemoryToPeripheral), //DAC2
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (pac::UART4, dr, u8),
    (pac::UART5, dr, u8),
    //(pac::DAC, ??),
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream1<DMA1>, Channel3, DMAR<pac::TIM2>, MemoryToPeripheral), //TIM2_UP
    (Stream1<DMA1>, Channel3, DMAR<pac::TIM2>, PeripheralToMemory), //TIM2_UP
    (Stream1<DMA1>, Channel3, CCR3<pac::TIM2>, MemoryToPeripheral), //TIM2_CH3
    (Stream1<DMA1>, Channel3, CCR3<pac::TIM2>, PeripheralToMemory), //TIM2_CH3
    //(pac::DMA1, Stream2, Channel1, DMAR<pac::TIM7>, MemoryToPeripheral), //TIM7_UP //dmar register appears to be missing
    //(pac::DMA1, Stream2, Channel1, DMAR<pac::TIM7>, PeripheralToMemory), //TIM7_UP //dmar register appears to be missing
    //(pac::DMA1, Stream4, Channel1, DMAR<pac::TIM7>, MemoryToPeripheral), //TIM7_UP //dmar register appears to be missing
    //(pac::DMA1, Stream4, Channel1, DMAR<pac::TIM7>, PeripheralToMemory), //TIM7_UP //dmar register appears to be missing
    (Stream7<DMA1>, Channel3, DMAR<pac::TIM2>, MemoryToPeripheral), //TIM2_UP
    (Stream7<DMA1>, Channel3, DMAR<pac::TIM2>, PeripheralToMemory), //TIM2_UP
    (Stream7<DMA1>, Channel3, CCR4<pac::TIM2>, MemoryToPeripheral), //TIM2_CH4
    (Stream7<DMA1>, Channel3, CCR4<pac::TIM2>, PeripheralToMemory), //TIM2_CH4
    (Stream1<DMA2>, Channel7, DMAR<pac::TIM8>, MemoryToPeripheral), //TIM8_UP
    (Stream1<DMA2>, Channel7, DMAR<pac::TIM8>, PeripheralToMemory), //TIM8_UP
    (Stream2<DMA2>, Channel0, CCR1<pac::TIM8>, MemoryToPeripheral), //TIM8_CH1
    (Stream2<DMA2>, Channel0, CCR1<pac::TIM8>, PeripheralToMemory), //TIM8_CH1
    (Stream2<DMA2>, Channel0, CCR2<pac::TIM8>, MemoryToPeripheral), //TIM8_CH2
    (Stream2<DMA2>, Channel0, CCR2<pac::TIM8>, PeripheralToMemory), //TIM8_CH2
    (Stream2<DMA2>, Channel0, CCR3<pac::TIM8>, MemoryToPeripheral), //TIM8_CH3
    (Stream2<DMA2>, Channel0, CCR3<pac::TIM8>, PeripheralToMemory), //TIM8_CH3
    (Stream2<DMA2>, Channel7, CCR1<pac::TIM8>, MemoryToPeripheral), //TIM8_CH1
    (Stream2<DMA2>, Channel7, CCR1<pac::TIM8>, PeripheralToMemory), //TIM8_CH1
    (Stream3<DMA2>, Channel7, CCR2<pac::TIM8>, MemoryToPeripheral), //TIM8_CH2
    (Stream3<DMA2>, Channel7, CCR2<pac::TIM8>, PeripheralToMemory), //TIM8_CH2
    (Stream4<DMA2>, Channel7, CCR3<pac::TIM8>, MemoryToPeripheral), //TIM8_CH3
    (Stream4<DMA2>, Channel7, CCR3<pac::TIM8>, PeripheralToMemory), //TIM8_CH3
    (Stream7<DMA2>, Channel7, CCR4<pac::TIM8>, MemoryToPeripheral), //TIM8_CH4
    (Stream7<DMA2>, Channel7, CCR4<pac::TIM8>, PeripheralToMemory), //TIM8_CH4
    (Stream7<DMA2>, Channel7, DMAR<pac::TIM8>, MemoryToPeripheral), //TIM8_COM/TRIG
    (Stream7<DMA2>, Channel7, DMAR<pac::TIM8>, PeripheralToMemory), //TIM8_COM/TRIG
    (Stream1<DMA1>, Channel4, pac::USART3, PeripheralToMemory),     //USART3_RX
    (Stream3<DMA1>, Channel4, pac::USART3, MemoryToPeripheral),     //USART3_TX
    (Stream4<DMA1>, Channel7, pac::USART3, MemoryToPeripheral),     //USART3_TX:DMA_CHANNEL_7
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (CCR1<pac::TIM8>, ccr1, u16),
    (CCR2<pac::TIM8>, ccr2, u16),
    (CCR3<pac::TIM8>, ccr3, u16),
    (CCR4<pac::TIM8>, ccr4, u16),
    (DMAR<pac::TIM8>, dmar, u16),
    (CCR3<pac::TIM2>, ccr3, u16),
    (DMAR<pac::TIM2>, dmar, u16),
    //(DMAR<pac::TIM7>, dmar), //Missing?
    (pac::USART3, dr, u8),
);

